Static Public Member Functions | List of all members
ACAPI::MEP::CableCarrierPort Class Referencefinal
MEP Element Manager
The CableCarrierPort represents a connection point of a cable carrier. More...
#include <MEPCableCarrierPort.hpp>
 Inheritance diagram for ACAPI::MEP::CableCarrierPort:
 Static Public Member Functions
static Result< CableCarrierPort >  | Get (const UniqueID &uniqueId)
Returns a CableCarrierPort.
 Additional Inherited Members
 Public Member Functions inherited from ACAPI::MEP::PortBase
bool  | Exists () const
GS::UniString  | GetName () const
Orientation  | GetOrientation () const
double  | GetWidth () const
double  | GetHeight () const
ConnectorShape  | GetShape () const
API_Coord3D  | GetPosition () const
Domain  | GetDomain () const
API_AttributeIndex  | GetMEPSystem () const
std::optional< UniqueID >  | GetConnectedPortId () const
std::optional< UniqueID >  | GetConnectedMEPElementId () const
UniqueID  | GetMEPElementId () const
bool  | IsPhysicallyConnected () const
Result< bool >  | IsPhysicallyConnectable (const UniqueID &portId) const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions inherited from ACAPI::MEP::PortBase
PortBase (std::shared_ptr< Impl::IPortBaseImpl > impl)
Constructs a PortBase with the given port base implementation.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The CableCarrierPort represents a connection point of a cable carrier.
Since
Archicad 27
Example code snippet from Test / New MEP
Take a look at PortBase
Member Function Documentation
◆ Get()
 static Result< CableCarrierPort > ACAPI::MEP::CableCarrierPort::Get  |  ( |  const UniqueID & |  uniqueId | )
static
Returns a CableCarrierPort.
Parameters
uniqueId | The UniqueID of the requested CableCarrierPort.
Returns
If the uniqueId belongs to a CableCarrierPort, returns the object associated to it, otherwise Error.